backend/app/controllers/api/v1/animes_controller.rb

    def index
        animes = Anime.all
---
SELECT "animes".* FROM "animes"

    def create
        anime = Anime.create(anime_params)
---
INSERT INTO "animes" ("title", "rating", "user_id", "review", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "hi"], ["rating", 7], ["user_id", 4], ["review", "heee"], ["created_at", "2021-02-23 23:32:11.254613"], ["updated_at", "2021-02-23 23:32:11.254613"]]

    def destroy
        anime = Anime.find_by(id: params[:id]).destroy
---
DELETE FROM "animes" WHERE "animes"."id" = ?  [["id", 2]]
SELECT "animes".* FROM "animes" WHERE "animes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]