backend/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "kitty"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Katie"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "kitty"], ["created_at", "2021-02-23 08:05:54.905404"], ["updated_at", "2021-02-23 08:05:54.905404"]]
---
    def create
        if User.find_by(:username => user_params[:username])
            user = User.find_by(:username => user_params[:username])
            redirect_to "/api/v1/users/#{user.id}"
        else
            user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        user = User.find_by(:id => params[:id].to_i)